# กรณี 1 print  มีข้อมูลหลายประเภม
# วิธีที่ 1 ใช้ ,
print(1234, "Hello", 3.14, True)
# วิธีที่ 2 ใช้ + (ข้อมูลไหนที่ไม่ใช่ string ต้องทำให้เป็น string ใช้ฟังก์ชั่น str())
# ไม่มีเว้น 1 space เหมือน ,
print(' Hello '+str(555)+' wow '+str(999)+str(True)+" hi ")
print('Hello'+str(555)+'wow'+str(999)+str(True)+"hi")
# วิธีที่ 3 ใฃ้เมธอต format () โดยข้อมูลที่แสดงอยู่ในรูปของ string
# (ข้อมูลที่ไม่ใช่ string ให้ใส่ใน () ของ format และตำแหน่งที่แสดงข้อมูลนั้นใส่ใน {})
print('Hello {} Wow {} Hi {} {}'.format(555,999,True,10+20-5,152.875))

# index number         0   1   2   3   4
print('{2} {4}'.format('a','b','c','d','e'))
# วิธีที่ 4 ใช้ f-string โดยข้อมูลที่แสดงอยู่ในรูปแบบชอง string โดยมี f อยู่ข้างหน้า
# (ข้อมูลที่ไม่ใช้ string ให้เขียนใส่ {} ณ ตำแหน่งนั้นๆ เลย)
print(f'Hello {555} Wow {999} {True} Hi {10+20-5} {152.875}')