# คำสั่งรับค่าข้อความทางแป้นพิมพ์ ใช้ฟังก์ชั่น ()
# ******* ตัวแปร varitable คือ ชื่อที่ Dev ตั้งขึ้นมาเอง (ต้องเป็นไปตามกดตามตั้งชื่ื่อ) เอาไว้เก็บข้อมูลที่เกิดขึ้นในโปรแกรม
# ฟังก์ชั่นแปลงข้อความเป็นตัวเลข int (), float()

fullname = input('ป้อนชื่อ: ')
year_born = input('ป้อนปีเกิด พ.ศ.: ')
print('----------------------')
print(f'สวัสดีคุณ {fullname}')
print(f'คุณเกิดในปี {year_born} ตอนนี้คุณอายุ {2568 - int(year_born)}')
print('-------------------')
# ใช้ ,
print('สวัสดีคุณ', fullname)
print('คุณเกิดในปี', year_born, 'ตอนนี้คุณอายุ', 2568 - int(year_born))
print('-------------------')
#ใช้ +
print('สวัสดีคุณ ' + fullname)
print('คุณเกิดในปี ' + str(year_born) + ' ตอนนี้คุณอายุ ' + str(2568 - int(year_born)))
print('-------------------')
#ใช้ format
print('สวัสดีคุณ {}'.format(fullname))
print('คุณเกิดในปี {} ตอนนี้คุณอายุ {}'.format(year_born, 2568 - int(year_born)))
print('-------------------')