# Control Flow / Control Stament แยกเป็น2 กลุ่มเช่นกัน
# 1. Selection/Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อย
# - พิสูจน์ตวรจสอบครั้งเดียว จริงทำ เท็จไม่ทำ  (if)
# - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จทำ    (if-else)
# - พิสูจน์ตรวจสอบหลายครั่ง               (if-elif-else)

# 2. Loop/Iteration/Repetion ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำๆ แยกเป็น 2 แบบ
#    - รู้จำนวนการทำซ้ำ
#    - ไม่รู้จำนวนครั้ง
#    - while, for
# **** สิิ่งที่ต้องระวังทำซ้ำต้องมีรู้จบ
 
# **** Statment ที่เกี่ยวกับ Control Flow คือคำสั่ง break, continue โดยเฉพาะ Loop