# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ 
# ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('----------------------------------')
print('       โปรแกรมคำนวณผลคูณ     ')
print('----------------------------------')

while True :
    a = int(input('ป้อนตัวเลขที่ 1 :'))
    b = int(input('ป้อนตัวเลขที่ 2 :'))
    result = a*b
    print(f'{a} x {b} = {result}')
    if result > 5000:
        break
    print(f"ผลคูณของ {a} และ {b}เท่ากับ {result} ")
print("ผลคูณมากกว่า 5000 โปรแกรมสิ้นสุดการทำงาน")
print('----------------------------------')

    
